Revit 2027 API
CoordinationModelLinkOptions Constructor
 Constructs a default instance of Coordination Model link options with the default CoordinationModelPositioning.
 The default CoordinationModelPositioning is OriginToInternalOrigin.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CoordinationModelLinkOptions()
Public Sub New
public:
CoordinationModelLinkOptions()
new : unit -> CoordinationModelLinkOptions
See Also
Reference
CoordinationModelLinkOptions Class
Autodesk.Revit.DB.ExternalData Namespace